testdata/IN_2023_02/fr-without-documents_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:all="http://www.bipro.net/namespace/allgemein" xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:bas="http://www.bipro.net/namespace/basis" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:fragen="http://www.bipro.net/namespace/fragen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:kapanl-basis="http://www.bipro.net/namespace/kapitalanlage/basis" xmlns:nac="http://www.bipro.net/namespace/nachrichten" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:par="http://www.bipro.net/namespace/partner" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:prod="http://www.bipro.net/namespace/produktmodell" xmlns:prod1="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:tar="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vb-leben="urn:de:vb:bipro:taa:leben:1.12" xmlns:vbl="urn:de:vb:bipro:taa:vbl:1.12" xmlns:ver="http://www.bipro.net/namespace/vertrag" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:xm="http://www.w3.org/2005/05/xmlmime" xmlns:xmime="http://www.w3.org/2005/05/xmlmime" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  	
  <soapenv:Header>
    		
    <wsse:Security>
      			
      <wsc:SecurityContextToken>
			
			</wsc:SecurityContextToken>
      		
    </wsse:Security>
    	
  </soapenv:Header>
  	
  <soapenv:Body>
    		
    <tarif:getQuote>
      			
      <tarif:Request>
        				
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
        				
        <tarif:Tarifierung>
          					
          <basis:Erweiterung xsi:type="vb-leben:CT_AntragErweiterung">
            						
            <vb-leben:DatenschutzeinwilligungTodesfall>false</vb-leben:DatenschutzeinwilligungTodesfall>
            						
            <vb-leben:AngabeZielmarkt>false</vb-leben:AngabeZielmarkt>
            					
          </basis:Erweiterung>
          					
          <gevo:Vermittler>
            						
            <basis:Erweiterung xsi:type="vb-leben:CT_VermittlerErweiterung">
              							
              <vb-leben:Buero>999</vb-leben:Buero>
              						
            </basis:Erweiterung>
            						
            <allg:Vermittlernummer>683/100</allg:Vermittlernummer>
            						
            <allg:PartnerID>VERMITTLER</allg:PartnerID>
            						
            <allg:Vermittlerrolle>
              							
              <allg:ArtID>01</allg:ArtID>
              							
              <allg:Vermittlertyp>01</allg:Vermittlertyp>
              						
            </allg:Vermittlerrolle>
            						
            <allg:Vermittlerrolle>
              							
              <allg:ArtID>01</allg:ArtID>
              							
              <allg:Vermittlertyp>02</allg:Vermittlertyp>
              						
            </allg:Vermittlerrolle>
            					
          </gevo:Vermittler>
          					
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
            						
            <partner:Name>Andre</partner:Name>
            						
            <partner:Namenszusatz1>Mahlstedt</partner:Namenszusatz1>
            						
            <partner:PartnerID>VERMITTLER</partner:PartnerID>
            						
            <partner:Anschrift>
              							
              <allg:Strasse>Swiss-Life-Platz</allg:Strasse>
              							
              <allg:Hausnummer>1</allg:Hausnummer>
              							
              <allg:Postleitzahl>30659</allg:Postleitzahl>
              							
              <allg:Ort>Hannover</allg:Ort>
              							
              <partner:ArtID>1</partner:ArtID>
              						
            </partner:Anschrift>
            						
            <partner:Kommunikationsverbindung>
              							
              <partner:ArtID>50</partner:ArtID>
              							
              <partner:Kommunikationsadresse>andre.mahlstedt1@swisslife-select.de</partner:Kommunikationsadresse>
              						
            </partner:Kommunikationsverbindung>
            					
          </tarif:Partner>
          					
          <tarif:Partner xsi:type="partner:CT_Person">
            						
            <partner:Anrede>1</partner:Anrede>
            						
            <partner:Name>Tester</partner:Name>
            						
            <partner:PartnerID>VERSICHERTE_PERSON</partner:PartnerID>
            						
            <partner:Anschrift>
              							
              <allg:Strasse>Beispielweg</allg:Strasse>
              							
              <allg:Hausnummer>1</allg:Hausnummer>
              							
              <allg:Postleitzahl>30659</allg:Postleitzahl>
              							
              <allg:Ort>Hannover</allg:Ort>
              						
            </partner:Anschrift>
            						
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risiko">
              							
              <pm-leben:Nichtraucher>true</pm-leben:Nichtraucher>
              						
            </partner:ZusaetzlichePartnerdaten>
            						
            <partner:Vorname>Tool</partner:Vorname>
            						
            <partner:Geburtsdatum>1981-11-19</partner:Geburtsdatum>
            						
            <partner:Geschlecht>1</partner:Geschlecht>
            						
            <partner:Geburtsort>Hannover</partner:Geburtsort>
            						
            <partner:Staatsangehoerigkeit>D</partner:Staatsangehoerigkeit>
            						
            <partner:Geburtsname>Tester</partner:Geburtsname>
            						
            <partner:Berufstaetigkeit>
              							
              <basis:Erweiterung xsi:type="vb-leben:CT_BerufstaetigkeitErweiterung">
                								
                <vb-leben:Personalverantwortung>false</vb-leben:Personalverantwortung>
                							
              </basis:Erweiterung>
              							
              <partner:Beruf>Bürokaufmann,frau</partner:Beruf>
              							
              <partner:StellungImBeruf xsi:type="dt:STE_StellungImBerufBasis">01</partner:StellungImBeruf>
              							
              <partner:KoerperlichTaetig>0</partner:KoerperlichTaetig>
              							
              <partner:NichtKoerperlichTaetig>100</partner:NichtKoerperlichTaetig>
              						
            </partner:Berufstaetigkeit>
            						
            <partner:Haushalt>
              							
              <partner:Haushaltsart xsi:type="dt:STE_HaushaltsartBasis">04</partner:Haushaltsart>
              						
            </partner:Haushalt>
            						
            <partner:Ausbildung>
              							
              <partner:ArtID xsi:type="dt:STE_AusbildungsartBasis">BeruflicheAusbildung</partner:ArtID>
              							
              <partner:HoechsterAbschluss xsi:type="vb-leben:STE_BildungsabschlussErweitert">KeinHochschulabschluss</partner:HoechsterAbschluss>
              						
            </partner:Ausbildung>
            					
          </tarif:Partner>
          					
          <tarif:Versicherungsnehmer>
            						
            <partner:PartnerID>VERSICHERTE_PERSON</partner:PartnerID>
            					
          </tarif:Versicherungsnehmer>
          					
          <tarif:Verkaufsprodukt>
            						
            <basis:Erweiterung xsi:type="vb-leben:CT_VerkaufsproduktErweiterung">
              							
              <vb-leben:OekoRenta>false</vb-leben:OekoRenta>
              							
              <vb-leben:Next>false</vb-leben:Next>
              						
            </basis:Erweiterung>
            						
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
              							
              <basis:Erweiterung xsi:type="vb-leben:CT_ProduktErweiterung">
                								
                <vb-leben:Beitragsrendite>
                  									
                  <vb-leben:Fondskostenberuecksichtigungsart>INDIVIDUELL</vb-leben:Fondskostenberuecksichtigungsart>
                  									
                  <vb-leben:Fondskostenberuecksichtigung>true</vb-leben:Fondskostenberuecksichtigung>
                  								
                </vb-leben:Beitragsrendite>
                							
              </basis:Erweiterung>
              							
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
              							
              <pm:Beitrag>
                								
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                								
                <pm:Betrag>
                  									
                  <allg:Betrag>100</allg:Betrag>
                  									
                  <allg:Waehrung>EUR</allg:Waehrung>
                  								
                </pm:Betrag>
                								
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                								
                <pm:Erhebung>
                  									
                  <allg:AnzahlJahre>26</allg:AnzahlJahre>
                  									
                  <allg:AnzahlMonate>1</allg:AnzahlMonate>
                  								
                </pm:Erhebung>
                							
              </pm:Beitrag>
              							
              <pm:Versicherungsdauer>
                								
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                							
              </pm:Versicherungsdauer>
              							
              <pm:Kennung>FR</pm:Kennung>
              							
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                								
                <basis:Erweiterung xsi:type="vb-leben:CT_RenteErweiterung">
                  									
                  <vb-leben:Monatsgenau>true</vb-leben:Monatsgenau>
                  									
                  <vb-leben:EintopfHochrechnungszins>7</vb-leben:EintopfHochrechnungszins>
                  									
                  <vb-leben:TodesfallleistungImBezug>IndividuelleGarantiezeit</vb-leben:TodesfallleistungImBezug>
                  									
                  <vb-leben:FondsrenteDaten>
                    										
                    <vb-leben:ErhoehterTodesfallschutz>true</vb-leben:ErhoehterTodesfallschutz>
                    									
                  </vb-leben:FondsrenteDaten>
                  								
                </basis:Erweiterung>
                								
                <pm:Versicherungsdauer>
                  									
                  <allg:AnzahlJahre>26</allg:AnzahlJahre>
                  									
                  <allg:AnzahlMonate>1</allg:AnzahlMonate>
                  								
                </pm:Versicherungsdauer>
                								
                <vs-pm:VersicherungssummeOderLeistung>
                  									
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                  									
                  <vs-pm:Wertschluessel xsi:type="vb-leben:STE_LeistungSchluesselErweitert">Fondsgebunden</vs-pm:Wertschluessel>
                  									
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                  									
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                  									
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                  								
                </vs-pm:VersicherungssummeOderLeistung>
                								
                <vs-pm:FondsPortfolio>
                  									
                  <vs-pm:Phase>Aufschubphase</vs-pm:Phase>
                  									
                  <vs-pm:FondsAnteil>
                    										
                    <kapanl-basis:ISIN>LU0280435388</kapanl-basis:ISIN>
                    										
                    <vs-pm:Garantiefonds>false</vs-pm:Garantiefonds>
                    										
                    <vs-pm:Prozentsatz>100</vs-pm:Prozentsatz>
                    									
                  </vs-pm:FondsAnteil>
                  								
                </vs-pm:FondsPortfolio>
                								
                <vs-pm:FondsPortfolio>
                  									
                  <vs-pm:Phase>Bezugsphase</vs-pm:Phase>
                  									
                  <vs-pm:FondsAnteil>
                    										
                    <kapanl-basis:ISIN>LU0327386305</kapanl-basis:ISIN>
                    										
                    <vs-pm:Garantiefonds>true</vs-pm:Garantiefonds>
                    										
                    <vs-pm:Prozentsatz>100</vs-pm:Prozentsatz>
                    									
                  </vs-pm:FondsAnteil>
                  								
                </vs-pm:FondsPortfolio>
                								
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                								
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">12</pm-leben:UeberschussverwendungVorLeistung>
                								
                <pm-leben:Endalter>67</pm-leben:Endalter>
                								
                <pm-leben:VersichertePerson>
                  									
                  <partner:PartnerID>VERSICHERTE_PERSON</partner:PartnerID>
                  								
                </pm-leben:VersichertePerson>
                								
                <pm-leben:BeitragsRueckgewaehrBeiTod>01</pm-leben:BeitragsRueckgewaehrBeiTod>
                								
                <pm-leben:BeitragsRueckgewaehrBeiAblauf>false</pm-leben:BeitragsRueckgewaehrBeiAblauf>
                								
                <pm-leben:Ablaufmanagement>false</pm-leben:Ablaufmanagement>
                								
                <pm-leben:Garantiezeit>
                  									
                  <allg:AnzahlJahre>18</allg:AnzahlJahre>
                  									
                  <allg:AnzahlMonate>0</allg:AnzahlMonate>
                  								
                </pm-leben:Garantiezeit>
                								
                <pm-leben:FlexibleAuszahlphase>
                  									
                  <allg:AnzahlJahre>0</allg:AnzahlJahre>
                  								
                </pm-leben:FlexibleAuszahlphase>
                							
              </pm:Elementarprodukt>
              							
              <pm-leben:VorgabeBerechnung>
                								
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                								
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                							
              </pm-leben:VorgabeBerechnung>
              						
            </pm:Produkt>
            					
          </tarif:Verkaufsprodukt>
          				
        </tarif:Tarifierung>
        			
      </tarif:Request>
      		
    </tarif:getQuote>
    	
  </soapenv:Body>
  
</soapenv:Envelope>
